app/views/posts/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]
---
  <div class="comments">
    <% post.recent_5_comments.each do |comment| %>