app/views/posts/show.html.erb

  <div class="comments">
    <% @post.recent_5_comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]