app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    new_comment = @post.comments.new(
      text: comment_params,
      user_id: current_user.id
    )
    new_comment.update_comments_counter
    if new_comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("text", "created_at", "updated_at", "user_id", "post_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "sdafsdf"], ["created_at", "2022-02-04 08:03:08.339912"], ["updated_at", "2022-02-04 08:03:08.339912"], ["user_id", 1], ["post_id", 1]]

  def destroy
    @comment = Comment.find(params[:commnet_id])
    @comment.destroy!
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 16]]