app/models/user.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT $1  [["LIMIT", 3]]
---
  def recent_3_posts
    Post.last(3)